УТ_для_edt/src/Catalogs/смартГрузы/смартГрузы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>смартГрузы</name>
  <attributes>
    <name>ПланируемаяДатаПоступления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоступления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Принят</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПолучатель</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаЗадержки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоэффициентНаценки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Партнёр</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусГруза</name>
    <type>
      <types>EnumRef.СтатусыГрузов</types>
    </type>
  </attributes>
  <attributes>
    <name>смарт_НомерТаможеннойДекларации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

УТ_для_edt/src/InformationRegisters/смартСобытияКонтейнеров/смартСобытияКонтейнеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>смартСобытияКонтейнеров</name>
  <dimensions>
    <name>Груз</name>
    <type>
      <types>CatalogRef.смартГрузы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контейнер</name>
    <type>
      <types>CatalogRef.смартКонтейнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаСобытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоСобытия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>СодержаниеСобытия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/Enums/СтатусыГрузов/СтатусыГрузов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыГрузов</name>
  <enumValues>
    <name>Формируется</name>
    <comment>#7624 смарт: Тимофеева 30.07.2026 / Справочник &quot;Грузы&quot;. Добавить статус</comment>
  </enumValues>
  <enumValues>
    <name>ВПути</name>
  </enumValues>
  <enumValues>
    <name>Принят</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Catalogs/ДополнительныеОтчетыИОбработки/ДополнительныеОтчетыИОбработки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДополнительныеОтчетыИОбработки</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>БезопасныйРежим</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Версия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Вид</name>
    <type>
      <types>EnumRef.ВидыДополнительныхОтчетовИОбработок</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>260</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Информация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьДляФормыОбъекта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьДляФормыСписка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Публикация</name>
    <type>
      <types>EnumRef.ВариантыПубликацииДополнительныхОтчетовИОбработок</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеНастроек</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеОбработки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетХранилищеВариантов</name>
    <comment>Когда Истина то дополнительный отчет подключен к хранилищу вариантов &quot;ХранилищеВариантовОтчетов&quot;.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТеснаяИнтеграцияСФормойОтчета</name>
    <comment>Когда Истина то у отчета есть программный интерфейс для тесной интеграции с общей формой &quot;ФормаОтчета&quot;.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимСовместимостиРазрешений</name>
    <type>
      <types>EnumRef.РежимыСовместимостиРазрешенийДополнительныхОтчетовИОбработок</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Команды</name>
    <attributes>
      <name>Идентификатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВариантЗапуска</name>
      <type>
        <types>EnumRef.СпособыВызоваДополнительныхОбработок</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоказыватьОповещение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Модификатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РегламентноеЗаданиеGUID</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Скрыть</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаменяемыеКоманды</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Назначение</name>
    <attributes>
      <name>ОбъектНазначения</name>
      <type>
        <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Разделы</name>
    <attributes>
      <name>Раздел</name>
      <type>
        <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Разрешения</name>
    <attributes>
      <name>ВидРазрешения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Параметры</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/Catalogs/смартГрузыПрисоединенныеФайлы/смартГрузыПрисоединенныеФайлы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>смартГрузыПрисоединенныеФайлы</name>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиСинхронизацииФайлов</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецФайла</name>
    <type>
      <types>CatalogRef.смартГрузы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаема</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаМодификацииУниверсальная</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Зашифрован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Изменил</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиСинхронизацииФайлов</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндексКартинки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписанЭП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлу</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Размер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расширение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Редактирует</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиСинхронизацииФайлов</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусИзвлеченияТекста</name>
    <type>
      <types>EnumRef.СтатусыИзвлеченияТекстаФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипХраненияФайла</name>
    <type>
      <types>EnumRef.ТипыХраненияФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>Том</name>
    <type>
      <types>CatalogRef.ТомаХраненияФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранитьВерсии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УдалитьЭлектронныеПодписи</name>
    <attributes>
      <name>ДатаПодписи</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяФайлаПодписи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>260</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КомуВыданСертификат</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Отпечаток</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>28</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подпись</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>УстановившийПодпись</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПроверкиПодписи</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ПодписьВерна</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьСертификатыШифрования</name>
    <attributes>
      <name>Отпечаток</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>28</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/Catalogs/смартГрузы/Forms/ФормаЭлемента/Module.bsl
#Область ДоработкиСмарт

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ФормаПринятьГруз.Доступность = Не Объект.Принят;
	Элементы.СкладПолучатель.ТолькоПросмотр = Объект.Принят;
	
	Если Параметры.Ключ.Пустая() Тогда 
		
		//++ #7624 смарт: Тимофеева 30.07.2026 / Справочник "Грузы". Добавить статус
		//Объект.СтатусГруза = ПредопределенноеЗначение("Перечисление.СтатусыГрузов.ВПути"); 
		Объект.СтатусГруза = ПредопределенноеЗначение("Перечисление.СтатусыГрузов.Формируется");
		//-- #7624 смарт: Тимофеева 30.07.2026 
		
		//++ #Б3634 смарт: Шляпников 26.06.2025 / Проставлять галочку в поле "Поступление одной датой" автоматически
		смартМенятьДатуВЗаказе=Истина;
		//-- #Б3634 смарт: Шляпников 26.06.2025
		
	Иначе
		
		//++#1374 смарт: Балашов 14.06.2023 //Разработать учет закупок в разрезе Контейнеров    
		Если Не ТипЗнч(Отказ) = Тип("Булево") Тогда 
			Отказ = Ложь; 
		КонецЕсли;
		
		смартПолучитьВсеКонтейнерыГруза(Отказ);
		//--#1374 смарт: Балашов 14.06.2023 
		
	КонецЕсли;
	
	//++ #1528 смарт: Фролов 26.10.2023 //смартГрузы версионирование
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	//-- #1528 смарт: Фролов 26.10.2023  
	
	//++ #1621 смарт: Мосолов 05.02.2024 //Грузы. Доработать ПрисоединеныеФайлы  
	
	НастроитьДинамическийСписок();
	
	Список.Параметры.УстановитьЗначениеПараметра("ВладелецФайлов", Объект.Ссылка);  
	
	ЗапрещенныеРасширения = РаботаСФайламиСлужебный.СписокЗапрещенныхРасширений();
	
	УстановитьВидимостьДоступность();
	//-- #1621 смарт: Мосолов 05.02.2024 

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьПриемкуГруза(Команда)
	// Фролов+
	ПоказатьВопрос(Новый ОписаниеОповещения("ПослеВопросаОбработатьПриему",ЭтотОбъект),
	"Старый функционал больше не доступен.
	|Введите 'Таможенную декларацию на импорт'.
	|Установить статус 'Принят' для всех документов?",
	РежимДиалогаВопрос.ДаНет);
	ОбработатьПриемГруза();
КонецПроцедуры

&НаСервере
Процедура ОбработатьПриемГруза()
	//Богус++
	Если НЕ ПроверитьВозможностьЗаписи() Тогда
		Возврат;
	КонецЕсли;
	// Фролов+ Убираем для перехода на Таможенную декларацию на импорт
	//Если Объект.КоэффициентНаценки <= 0 Тогда
	//	Сообщить("Не задан коэффициент наценки!");
	//	Возврат;
	//КонецЕсли;
	//Богус--
	
	//НачатьТранзакцию();
	//
	//ОрганизацицияПоПоступлению = Справочники.Организации.ПустаяСсылка();
	//СкладПолучатель = Объект.СкладПолучатель;
	// Фролов-
	//Богус закоментировал.
	//Если Объект.КоэффициентНаценки > 0 Тогда
	//	ДокументДопРасходов = Документы.ПоступлениеУслугПрочихАктивов.СоздатьДокумент();
	//	ДокументДопРасходов.Организация = Константы.ОрганизацияПеревозкаГрузов.Получить();
	//	ДокументДопРасходов.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщика;
	//	ДокументДопРасходов.Дата = Объект.ДатаПоступления;
	//	ДокументДопРасходов.Партнер = Константы.ПартнерПеревозкаГрузов.Получить();
	//	ДокументДопРасходов.Контрагент = Константы.КонтрагентПеревозкаГрузов.Получить();
	//	ДокументДопРасходов.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС;
	//КонецЕсли;
	
	
	//Фролов+ Убрал потому что не нужно в ЗаказеПоставщику менять склад в табличной части Товары
	//Запрос = Новый Запрос;
	//Запрос.Текст =
	//"ВЫБРАТЬ
	//|	ПоступлениеТоваровУслугТовары.ЗаказПоставщику КАК Заказ,
	//|	ПоступлениеТоваровУслугТовары.КодСтроки КАК КодСтрокиЗаказа,
	//|	ПоступлениеТоваровУслугТовары.Склад КАК Склад
	//|ИЗ
	//|	Документ.ПриобретениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	//|ГДЕ
	//|	ПоступлениеТоваровУслугТовары.Ссылка.Груз = &Груз
	//|	И ПоступлениеТоваровУслугТовары.Ссылка.СтатусГруза = ЗНАЧЕНИЕ(Перечисление.СтатусыГрузов.ВПути)
	//|ИТОГИ ПО
	//|	Заказ";
	//
	//Запрос.УстановитьПараметр("Груз", Объект.Ссылка);
	//ВыборкаПоЗаказам = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//Пока ВыборкаПоЗаказам.Следующий() Цикл
	//	ЗаказПоставщику = ВыборкаПоЗаказам.Заказ;
	//	Если ЗначениеЗаполнено(ЗаказПоставщику) Тогда
	//		ЗаказОбъект = ЗаказПоставщику.ПолучитьОбъект();
	//		ВыборкаПоТоварам = ВыборкаПоЗаказам.Выбрать();
	//		Пока ВыборкаПоТоварам.Следующий() Цикл
	//			МассивСтрок = ЗаказОбъект.Товары.НайтиСтроки(Новый Структура("КодСтроки", ВыборкаПоТоварам.КодСтрокиЗаказа));
	//			Если МассивСтрок.Количество() > 0 Тогда
	//				СтрокаЗаказа = МассивСтрок[0];
	//				СтрокаЗаказа.Склад = СкладПолучатель;
	//			КонецЕсли;
	//		КонецЦикла;
	//		ЗаказОбъект.Записать(РежимЗаписиДокумента.Проведение);
	//	КонецЕсли;
	//КонецЦикла;
	НачатьТранзакцию();
	//Фролов-
	
	ЗапросПоДокументам = Новый Запрос;
	ЗапросПоДокументам.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаТовары.Ссылка КАК ДокументПоступление
	|ИЗ
	|	Документ.ПриобретениеТоваровУслуг КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.Груз = &Груз
	|	И ТаблицаТовары.СтатусГруза = ЗНАЧЕНИЕ(Перечисление.СтатусыГрузов.ВПути)
	|	И ТаблицаТовары.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступлениеТоваров.Ссылка
	|ИЗ
	//++ смарт:ММ #016 161 23.01.2020 - обновление 11.4.7.150
	//|	Документ.ПоступлениеТоваров КАК ПоступлениеТоваров
	|	Документ.ПоступлениеТоваровНаСклад КАК ПоступлениеТоваров
	//-- смарт:ММ 23.01.2020
	|ГДЕ
	|	ПоступлениеТоваров.Проведен
	|	И ПоступлениеТоваров.Груз = &Груз
	|	И ПоступлениеТоваров.СтатусГруза = ЗНАЧЕНИЕ(Перечисление.СтатусыГрузов.ВПути)";
	
	ЗапросПоДокументам.УстановитьПараметр("Груз", Объект.Ссылка);
	ВыборкаПоДокументам = ЗапросПоДокументам.Выполнить().Выбрать();
	Пока ВыборкаПоДокументам.Следующий() Цикл
		ДокументОбъект = ВыборкаПоДокументам.ДокументПоступление.ПолучитьОбъект();
		// Фролов+ Убираем для перехода на Таможенную декларацию на импорт
		Попытка
			ДокументОбъект.Заблокировать();
		Исключение
			Сообщить("Нет возможности заблокировать документ: "+ДокументОбъект+"  "+ОписаниеОшибки());
		КонецПопытки;
		//ТЧТовары = ДокументОбъект.Товары;
		////Богус++
		//Если ОрганизацицияПоПоступлению.Пустая() Или ОрганизацицияПоПоступлению <> ДокументОбъект.Организация Тогда
		//	ДокументДопРасходов = Документы.ПриобретениеУслугПрочихАктивов.СоздатьДокумент();
		//	ДокументДопРасходов.Организация = ДокументОбъект.Организация;
		//	ДокументДопРасходов.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщика;
		//	ДокументДопРасходов.Дата = Объект.ДатаПоступления + 32400;
		//	ДокументДопРасходов.Партнер = Объект.Партнёр;//Константы.ПартнерПеревозкаГрузов.Получить();
		//	ДокументДопРасходов.Контрагент = Объект.Контрагент;//Константы.КонтрагентПеревозкаГрузов.Получить();
		//	ДокументДопРасходов.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС;
		//	ДокументДопРасходов.ЗакупкаПодДеятельность = ДокументОбъект.ЗакупкаПодДеятельность;                    
		//	ОрганизацицияПоПоступлению = ДокументОбъект.Организация;
		//КонецЕсли;	
		//Богус--
		// Фролов+ Склады не меняем
		//Для Каждого СтрокаТЧ Из ТЧТовары Цикл
		//	СтрокаТЧ.Склад = СкладПолучатель;
		//КонецЦикла;
		// Фролов-
		ДокументОбъект.СтатусГруза = Перечисления.СтатусыГрузов.Принят;
		// Проверить!!!!
		//ДокументОбъект.Дата = Объект.ДатаПоступления + 32400;
		//

		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		ДокументОбъект.Разблокировать();
		//СтрокаРасходов = ДокументДопРасходов.Расходы.Добавить();
		//СтрокаРасходов.Содержание = "Доп. расходы по доставке груза " + Объект.Наименование;
		//СтрокаРасходов.СтатьяРасходов = ПланыВидовХарактеристик.СтатьиРасходов.НайтиПоНаименованию("Расходы по доставке грузов");
		//СтрокаРасходов.АналитикаРасходов = ДокументОбъект.Ссылка;
		//СтрокаРасходов.Цена = Объект.КоэффициентНаценки*ДокументОбъект.СуммаДокумента;
		//СтрокаРасходов.Количество = 1;
		//СтрокаРасходов.Сумма = СтрокаРасходов.Цена;
		//ДокументДопРасходов.Валюта = ДокументОбъект.Валюта;
		//ДокументДопРасходов.ВалютаВзаиморасчетов = ДокументДопРасходов.Валюта;
		//// Фролов+ 
		//ДокументДопРасходов.ПорядокОплаты=ДокументОбъект.ПорядокОплаты;
		//СтрокаРасходов.Подразделение=ДокументОбъект.Подразделение;
		//// Фролов-
		////Богус++
		//ДокументДопРасходов.Груз = Объект.Ссылка;
		//ДокументДопРасходов.Записать(РежимЗаписиДокумента.Проведение);
		//Объект.Принят = Истина;
		//Записать();
		//Элементы.ФормаПринятьГруз.Доступность = Ложь;
        //Богус--
		
		// Фролов-
	КонецЦикла;
	//ДокументДопРасходов.ВалютаВзаиморасчетов = ДокументДопРасходов.Валюта;
	//ДокументДопРасходов.Груз = Объект.Ссылка;
	//ДокументДопРасходов.Записать(РежимЗаписиДокумента.Проведение);
	Объект.Принят = Истина;
	Записать();
	Элементы.ФормаПринятьГруз.Доступность = Ложь;
	Элементы.Принят.Доступность = Ложь;
	
	ЗафиксироватьТранзакцию();
КонецПроцедуры

//Богус++
&НаКлиенте
Процедура ОтменитьПриемкуГруза(Команда)
	// Фролов+
	ПоказатьВопрос(Новый ОписаниеОповещения("ПослеВопросаОтменитьПриему",ЭтотОбъект),"Установить статус 'В пути' для всех документов?",РежимДиалогаВопрос.ДаНет);
	// Фролов-
	//ОтменитьПриемГруза();  // Фролов+- будет вызвано после ответа на вопрос
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОтменитьПриему(Результат,ДопПараметры)Экспорт
	Если Результат=КодВозвратаДиалога.Да Тогда 
		ОтменитьПриемГруза();
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОбработатьПриему(Результат,ДопПараметры)Экспорт 
	Если Результат=КодВозвратаДиалога.Да Тогда 
		ОбработатьПриемГруза();
	КонецЕсли;
КонецПроцедуры	

&НаСервере
Процедура ОтменитьПриемГруза()
	
	Если НЕ Объект.Принят Тогда
		Сообщить("Груз не принят");
		Возврат;
	КонецЕсли;	
		
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПоступлениеТоваровУслуг.Ссылка КАК ПоступлениеТоваровУслуг
	|ИЗ
	|	Документ.ПриобретениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	|ГДЕ
	|	ПоступлениеТоваровУслуг.Груз = &Груз
	|	И ПоступлениеТоваровУслуг.СтатусГруза = ЗНАЧЕНИЕ(Перечисление.СтатусыГрузов.Принят)
	|	И ПоступлениеТоваровУслуг.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступлениеТоваров.Ссылка
	|ИЗ
	//++ смарт:ММ #016 161 23.01.2020 - обновление 11.4.7.150
	//|	Документ.ПоступлениеТоваров КАК ПоступлениеТоваров
	|	Документ.ПоступлениеТоваровНаСклад КАК ПоступлениеТоваров
	//-- смарт:ММ 23.01.2020
	|ГДЕ
	|	ПоступлениеТоваров.Проведен
	|	И ПоступлениеТоваров.Груз = &Груз
	|	И ПоступлениеТоваров.СтатусГруза = ЗНАЧЕНИЕ(Перечисление.СтатусыГрузов.Принят)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоступлениеУслугПрочихАктивовРасходы.Ссылка КАК ПоступлениеУслугПрочихАктивовРасходы
	|ИЗ
	|	Документ.ПриобретениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриобретениеУслугПрочихАктивов.Расходы КАК ПоступлениеУслугПрочихАктивовРасходы
	|		ПО ПоступлениеТоваровУслуг.Ссылка = ПоступлениеУслугПрочихАктивовРасходы.АналитикаРасходов
	|ГДЕ
	|	ПоступлениеТоваровУслуг.Груз = &Груз
	|	И ПоступлениеТоваровУслуг.СтатусГруза = ЗНАЧЕНИЕ(Перечисление.СтатусыГрузов.Принят)
	|	И НЕ ПоступлениеУслугПрочихАктивовРасходы.Ссылка ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеУслугПрочихАктивовРасходы.Ссылка";
	
	Запрос.УстановитьПараметр("Груз", Объект.Ссылка);
	Результат = Запрос.ВыполнитьПакет();
	Если Результат.Количество()=0 Тогда
		Возврат;
	Конецесли;	
	ВыборкаПоПоступлениям = Результат[0].Выбрать();
	ВыборкаПоДопРасходам =  Результат[1].Выбрать();
	НачатьТранзакцию();
	Пока ВыборкаПоПоступлениям.Следующий() Цикл
		ПоступлениеТоваровУслуг = ВыборкаПоПоступлениям.ПоступлениеТоваровУслуг;
		Если ПоступлениеТоваровУслуг.Проведен Тогда
			ДокументПоступленияТоваров = ПоступлениеТоваровУслуг.ПолучитьОбъект();
			Попытка
				ДокументПоступленияТоваров.Заблокировать();
			Исключение
				Сообщить("Нет возможности заблокировать документ: "+ПоступлениеТоваровУслуг+"  "+ОписаниеОшибки());
				ОтменитьТранзакцию();
				Возврат;
			КонецПопытки;	
			ДокументПоступленияТоваров.СтатусГруза = Перечисления.СтатусыГрузов.ВПути; 
			ДокументПоступленияТоваров.Записать(РежимЗаписиДокумента.Проведение);
			ДокументПоступленияТоваров.Разблокировать();
		КонецЕсли;
	КонецЦикла;
	Если ВыборкаПоДопРасходам.Количество() > 0 Тогда
		Пока ВыборкаПоДопРасходам.Следующий() Цикл
			ПоступлениеУслугПрочихАктивов = ВыборкаПоДопРасходам.ПоступлениеУслугПрочихАктивовРасходы;
			Если ПоступлениеУслугПрочихАктивов.Проведен Тогда
				ДокументДопРасходовОбъект = ПоступлениеУслугПрочихАктивов.ПолучитьОбъект();
				Попытка
					ДокументДопРасходовОбъект.УстановитьПометкуУдаления(Истина);
				Исключение
					ТекстОшибки = НСтр("ru='Не удалось установить пометку удаления для документа %Документ%. %ОписаниеОшибки%'");
					ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Документ%", ДокументДопРасходовОбъект);
					ТекстОшибки = СтрЗаменить(ТекстОшибки, "%ОписаниеОшибки%", КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ДокументДопРасходовОбъект);
				КонецПопытки;
				//ДокументДопРасходовОбъект.Удалить();
			КонецЕсли;
		КонецЦикла;
    КонецЕсли;
		
	
	Объект.Принят = Ложь;
	Элементы.Принят.Доступность = Истина;
	Записать();
	Элементы.ФормаПринятьГруз.Доступность = Истина;
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ Объект.Принят Тогда
		Элементы.Принят.Доступность = Истина;
	Иначе
		Элементы.Принят.Доступность = Ложь;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Код) Тогда
		Объект.ДатаСоздания = ТекущаяДата();
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция ПроверитьВозможностьЗаписи() Экспорт
		

	Если ЗначениеЗаполнено(Объект.Код) Тогда
		Возврат Истина;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Грузы.Ссылка
		|ИЗ
	//++#1374 смарт: Балашов 14.06.2023 //Разработать учет закупок в разрезе Контейнеров    
		|	Справочник.смартГрузы КАК Грузы
	//--#1374 смарт: Балашов 14.06.2023
		|ГДЕ
		|	Грузы.Наименование = &Наименование
		|	И НЕ Грузы.ПометкаУдаления";

	Запрос.УстановитьПараметр("Наименование", Объект.Наименование);

	Результат = Запрос.Выполнить();

	Если НЕ Результат.Пустой() Тогда
		Сообщить("Груз с наименовнием " + Объект.Наименование + " уже существует. Введите другое наименование.");
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;	

	
КонецФункции

&НаКлиенте
Процедура смарт_СоставГрузаВместо(Команда)
	ПараметрыФормы = Новый Структура("Отбор, КлючНазначенияИспользования, КлючВарианта, СформироватьПриОткрытии");

	ПараметрыФормы.Отбор = Новый Структура("Груз", Объект.Ссылка);	
	ПараметрыФормы.КлючВарианта = "Основной";
	ПараметрыФормы.СформироватьПриОткрытии = Истина;
			
	ОткрытьФорму("Отчет.смартСоставГрузовЗаказПоставщику2022.Форма", ПараметрыФормы, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура смарт_НеотгруженныеТоварыПоставщикаВместо(Команда)
	ПараметрыФормы = Новый Структура("Отбор, КлючНазначенияИспользования, КлючВарианта, СформироватьПриОткрытии");

	ПараметрыФормы.Отбор = Новый Структура("Груз", Объект.Ссылка);	
	ПараметрыФормы.КлючВарианта = "Основной";
	ПараметрыФормы.СформироватьПриОткрытии = Истина;
			
	ОткрытьФорму("Отчет.смартНеОтгруженныеТоварыПоставщика.Форма", ПараметрыФормы, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаИзмененияДаты(Результат,ДопПараметры)Экспорт 
	Если Результат=КодВозвратаДиалога.Да Тогда 
		смартМенятьДатуВЗаказе=Истина;
	Иначе
		Объект.ПланируемаяДатаПоступления=смартСтараяПланируемаяДатаПоступления;
	КонецЕсли;	
КонецПроцедуры	

&НаКлиенте
Процедура ПланируемаяДатаПоступленияПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		ТекстВопроса="При именении 'Планируемой даты поступления'
		|в связанных документах будет изменена 'Желаемая дата поступления'
		| Продолжить?";
		ПоказатьВопрос(Новый ОписаниеОповещения("ПослеВопросаИзмененияДаты",ЭтаФорма),ТекстВопроса,РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
		
	//++ #1812 смарт: Ермаков 08.05.2024 / Проблема с авторезервированием
	Если смартМенятьДатуВЗаказе Тогда
		смартОбеспечение.РезервыКДатеУстановитьДатуПоступленияВЗаказахПоставщикам(Объект.Ссылка, Отказ);			
	КонецЕсли;
	//-- #1812 смарт: Ермаков 08.05.2024
	
	//++ #1621 смарт: Мосолов 05.02.2024 //Грузы. Доработать ПрисоединеныеФайлы   
	Если Не Отказ Тогда
		смартЗаписатьИсториюКонтейнеровНаСервере(); 
	КонецЕсли;
	//-- #1621 смарт: Мосолов 05.02.2024  

	//++#1374 смарт: Балашов 13.07.2023 //Разработать учет закупок в разрезе Контейнеров
	смартПолучитьВсеКонтейнерыГруза(Отказ);
	//--#1374 смарт: Балашов 13.07.2023
	
КонецПроцедуры

&НаКлиенте
Процедура ПланируемаяДатаПоступленияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Объект.ПланируемаяДатаПоступления) Тогда 
		смартСтараяПланируемаяДатаПоступления=Объект.ПланируемаяДатаПоступления;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура смарт_СтатусГрузаПриИзменении(Элемент)
	//Если ЗначениеЗаполнено(Объект.Ссылка) Тогда 
	//	ТекстВопроса="При именении 'Статуса груза'
	//	|в связанных документах будет так же изменен 'Статус груза'
	//	| Продолжить?";
	//	ПоказатьВопрос(Новый ОписаниеОповещения("ПослеВопросаИзмененияСтатусаГруза",ЭтаФорма),ТекстВопроса,РежимДиалогаВопрос.ДаНет);
	//КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаИзмененияСтатусаГруза(Результат,ДопПараметры)Экспорт 
	Если Результат=КодВозвратаДиалога.Да Тогда 
		смартМенятьСтатусГруза=Истина;
	Иначе
		Объект.СтатусГруза=смартСтарыйСтатусГруза;
	КонецЕсли;	
КонецПроцедуры	

&НаКлиенте
Процедура смарт_СтатусГрузаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	//смартСтарыйСтатусГруза=Объект.СтатусГруза;
КонецПроцедуры

//++ смарт:Подкин #966 05.04.2022 11:44:43
&НаКлиенте
Процедура СоставГрузаПоступление(Команда)
	
	//++ #1569 смарт: Ермаков 05.12.2023 / Изменить отчет Состав грузов (продолжение задачи 1527)	
	ДополнительныйОтчетСсылка = ПолучитьСсылкуДополнительныйОтчетАнализСоставовГрузов(); 
	ИмяОтчета = ДополнительныеОтчетыИОбработкиВызовСервера.ПодключитьВнешнююОбработку(ДополнительныйОтчетСсылка);
	
	ПараметрыОткрытия = Новый Структура("Отбор, КлючВарианта, СформироватьПриОткрытии",
											Новый Структура("Груз", Объект.Ссылка),
											"СоставГрузаПоПоступлениям",
											Истина);
											
	//++ #1586 смарт: Ермаков 21.12.2023 / Отчет "Состав грузов". Некорректно открывается форма отчета
	Уникальность = "ВнешнийОтчет." + ИмяОтчета + "/КлючВарианта.СоставГрузаПоПоступлениям" + Строка(Новый УникальныйИдентификатор);
	//-- #1586 смарт: Ермаков 21.12.2023 / Отчет "Состав грузов". Некорректно открывается форма отчета
	
	ОткрытьФорму("ВнешнийОтчет." + ИмяОтчета + ".Форма", 
					ПараметрыОткрытия, 
					Неопределено, 
					Уникальность);
	//-- #1569 смарт: Ермаков 05.12.2023 / Изменить отчет Состав грузов (продолжение задачи 1527)						
					
КонецПроцедуры //-- смарт:Подкин #966 05.04.2022 11:44:43

//++ #1569 смарт: Ермаков 05.12.2023 / Изменить отчет Состав грузов (продолжение задачи 1527)	
&НаСервере
Функция ПолучитьСсылкуДополнительныйОтчетАнализСоставовГрузов() Экспорт
	
	Возврат Справочники.ДополнительныеОтчетыИОбработки.НайтиПоРеквизиту("ИмяОбъекта", "АнализСоставовГрузов");
	
КонецФункции
//-- #1569 смарт: Ермаков 05.12.2023 / Изменить отчет Состав грузов (продолжение задачи 1527)	

//++#1374 смарт: Балашов 14.06.2023 //перенос из расширения, рефакторинг справочника Грузы
&НаКлиенте
Процедура СоставГруза2020(Команда)
    ПараметрыФормы = Новый Структура("Отбор, КлючНазначенияИспользования, КлючВарианта, СформироватьПриОткрытии");
    
    ПараметрыФормы.Отбор = Новый Структура("Груз", Объект.Ссылка);	
    ПараметрыФормы.КлючВарианта = "Основной2020";
    ПараметрыФормы.СформироватьПриОткрытии = Истина;
    
    ОткрытьФорму("Отчет.смартСоставГрузов2020.Форма", ПараметрыФормы, ЭтаФорма);
КонецПроцедуры //--#1374 смарт: Балашов 14.06.2023     

//++#1374 смарт: Балашов 14.06.2023 //Разработать учет закупок в разрезе Контейнеров
&НаКлиенте
Процедура смартСписокКонтейнеровПриАктивизацииСтроки(Элемент)
	ТекДанные = Элементы.СписокКонтейнеров.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда
		ТекКонтейнер = ТекДанные.Контейнер;
		Если Не ТекКонтейнер = Неопределено Тогда
			Элементы.СобытияКонтейнера.ОтборСтрок = Новый ФиксированнаяСтруктура("Груз, Контейнер", Объект.Ссылка, ТекКонтейнер);	
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры //--#1374 смарт: Балашов 14.06.2023

//++#1374 смарт: Балашов 14.06.2023 //Разработать учет закупок в разрезе Контейнеров
&НаКлиенте
Процедура смартСобытияКонтейнераПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование) 
	ТекДанные = Элементы.СписокКонтейнеров.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда
		ТекКонтейнер = Элементы.СписокКонтейнеров.ТекущиеДанные.Контейнер;
		Если НоваяСтрока Тогда
			Элемент.ТекущиеДанные.Груз = Объект.Ссылка;
			Элемент.ТекущиеДанные.Контейнер = ТекКонтейнер;
		КонецЕсли;
		Элементы.СобытияКонтейнера.ОтборСтрок = Новый ФиксированнаяСтруктура("Груз, Контейнер", Объект.Ссылка, ТекКонтейнер);	
	КонецЕсли;	
КонецПроцедуры //--#1374 смарт: Балашов 14.06.2023

//++#1374 смарт: Балашов 14.06.2023 //Разработать учет закупок в разрезе Контейнеров
&НаСервере
Процедура смартПолучитьВсеКонтейнерыГруза(Отказ)
	//найдем все контейнеры груза 
	//проверим есть ли "пустые" контейнеры перед записью
//	Отмена = ложь; 
	Если Отказ Тогда Возврат КонецЕсли;

	Для Каждого текКонтейнер Из СписокКонтейнеров Цикл
		Если текКонтейнер.Контейнер = Справочники.смартКонтейнеры.ПустаяСсылка() Тогда 
			Сообщить("В списке контейнеров присутствует ""пустой"" контейнер. Запись невозможна.");
			Отказ = истина;
			Прервать;
		КонецЕсли;	
	КонецЦикла;	
	
	Если Отказ Тогда Возврат КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.смартСобытияКонтейнеров.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Груз.Установить(Объект.Ссылка);
	НаборЗаписей.Прочитать(); 
	//Если НаборЗаписей.Количество() = 0 Тогда
	//	смартЗаписатьИсториюКонтейнеровНаСервере();
	//КонецЕсли;	
	//Если Не Объект.Ссылка = Справочники.смартГрузы.ПустаяСсылка() Тогда
		СобытияКонтейнера.Очистить();
		СписокКонтейнеров.Очистить(); 
	//КонецЕсли;	
	Для Каждого Запись Из НаборЗаписей Цикл
		Отбор = Новый Структура("Контейнер", Запись.Контейнер);
		СтрокиОтбора = СписокКонтейнеров.НайтиСтроки(Отбор);
		Если СтрокиОтбора.Количество() = 0 Тогда
			НовСтрока = СписокКонтейнеров.Добавить();
			НовСтрока.Контейнер = Запись.Контейнер;
		КонецЕсли;	
		//заполним Таблицу событий 
		Если ЗначениеЗаполнено(Запись.ДатаСобытия) Тогда
			НовСобытие = СобытияКонтейнера.Добавить();
			НовСобытие.Груз = Запись.Груз;
			НовСобытие.Контейнер = Запись.Контейнер;
			НовСобытие.ДатаСобытия = Запись.ДатаСобытия;
			НовСобытие.МестоСобытия = Запись.МестоСобытия;
			НовСобытие.СодержаниеСобытия = Запись.СодержаниеСобытия;
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры//--#1374 смарт: Балашов 14.06.2023

//++#1374 смарт: Балашов 14.06.2023 //Разработать учет закупок в разрезе Контейнеров
&НаСервере
Процедура смартЗаписатьИсториюКонтейнеровНаСервере()
	//очистим регистр истории по
	НаборЗаписей = РегистрыСведений.смартСобытияКонтейнеров.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Груз.Установить(Объект.Ссылка);
	НаборЗаписей.Записать();
	//запишем события контейнеров по грузу
	Для Каждого Элемент Из СписокКонтейнеров Цикл
		//проверим есть ли записи в событиях
		Если ЗначениеЗаполнено(Элемент.Контейнер) Тогда
			СтрокиСобытий = СобытияКонтейнера.НайтиСтроки(Новый Структура("Груз, Контейнер", Объект.Ссылка, Элемент.Контейнер));	
			Если СтрокиСобытий.Количество() > 0 Тогда
				Для Каждого СтрокаСобытия Из СтрокиСобытий Цикл 
					НаборЗаписей.Отбор.Сбросить();
					НаборЗаписей.Отбор.Груз.Установить(Объект.Ссылка);
					НаборЗаписей.Отбор.Контейнер.Установить(Элемент.Контейнер); 
					НаборЗаписей.Отбор.ДатаСобытия.Установить(СтрокаСобытия.ДатаСобытия); 
					НаборЗаписей.Отбор.МестоСобытия.Установить(СтрокаСобытия.МестоСобытия); 
	                НаборЗаписей.Прочитать();
					Запись = НаборЗаписей.Добавить();
					Запись.Груз = Объект.Ссылка;
					Запись.Контейнер = Элемент.Контейнер;
					Запись.ДатаСобытия = СтрокаСобытия.ДатаСобытия;
					Запись.МестоСобытия = СтрокаСобытия.МестоСобытия;
					Запись.СодержаниеСобытия = СтрокаСобытия.СодержаниеСобытия;
					НаборЗаписей.Записать();
				КонецЦикла;	
			Иначе
				НаборЗаписей.Отбор.Сбросить();
				НаборЗаписей.Отбор.Груз.Установить(Объект.Ссылка);
				НаборЗаписей.Отбор.Контейнер.Установить(Элемент.Контейнер); 
	            НаборЗаписей.Прочитать();
				Если НаборЗаписей.Количество() = 0 Тогда
					Запись = НаборЗаписей.Добавить();
				Иначе
					Запись = НаборЗаписей[0];
				КонецЕсли;	
				Запись.Груз = Объект.Ссылка;
				Запись.Контейнер = Элемент.Контейнер;
				НаборЗаписей.Записать();
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры//--#1374 смарт: Балашов 14.06.2023

//++#1374 смарт: Балашов 14.06.2023 //Разработать учет закупок в разрезе Контейнеров
&НаКлиенте
Процедура смартСобытияКонтейнераПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если ЭтотОбъект.СписокКонтейнеров.Количество() = 0 Тогда
		Сообщить("Контейнер не выбран. Добавить событие не возможно.");
		Отказ = истина;
		Возврат;
	Иначе
		ТекКонтейнер = Элементы.СписокКонтейнеров.ТекущиеДанные.Контейнер;
		Если Не ЗначениеЗаполнено(ТекКонтейнер) Тогда
			Сообщить("Контейнер ""пустой"". Добавить событие не возможно.");
			Отказ = истина;
			Возврат;
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры//--#1374 смарт: Балашов 14.06.2023


//++#1374 смарт: Балашов 18.07.2023 //Разработать учет закупок в разрезе Контейнеров
&НаКлиенте
Процедура СписокКонтейнеровПриИзменении(Элемент)
	
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры//--#1374 смарт: Балашов 18.07.2023

//++#1374 смарт: Балашов 18.07.2023 //Разработать учет закупок в разрезе Контейнеров
&НаКлиенте
Процедура СобытияКонтейнераПриИзменении(Элемент)
	ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры//--#1374 смарт: Балашов 18.07.2023

//++ #1621 смарт: Мосолов 05.02.2024 //Грузы. Доработать ПрисоединеныеФайлы 
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	УстановитьВидимостьДоступность();
КонецПроцедуры //-- #1621 смарт: Мосолов 05.02.2024

//++ #1621 смарт: Мосолов 05.02.2024 //Грузы. Доработать ПрисоединеныеФайлы 
&НаСервере
Процедура УстановитьВидимостьДоступность()
	
	Элементы.Список.Доступность 				= ЗначениеЗаполнено(Объект.Ссылка); 
	Элементы.СписокКонтейнеров.ТолькоПросмотр 	= НЕ ЗначениеЗаполнено(Объект.Ссылка);
	Элементы.СобытияКонтейнера.ТолькоПросмотр 	= НЕ ЗначениеЗаполнено(Объект.Ссылка);
	
	//++ #1638 смарт: Ермаков 20.02.2024 / Грузы. Сделать связь объектов. 
	СписокКонтейнеровОбновитьИнформациюОСмежныхГрузах();
	//-- #1638 смарт: Ермаков 20.02.2024
	
КонецПроцедуры //-- #1621 смарт: Мосолов 05.02.2024 

//++ #1621 смарт: Мосолов 05.02.2024 //Грузы. Доработать ПрисоединеныеФайлы 
&НаСервере
Процедура НастроитьДинамическийСписок()
	
	СвойстваСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Файлы.Ссылка КАК Ссылка,
	|	Файлы.ПометкаУдаления,
	|	ВЫБОР
	|		КОГДА Файлы.ПометкаУдаления = ИСТИНА
	|		ТОГДА ЕСТЬNULL(Файлы.ИндексКартинки, 2) + 1
	|		ИНАЧЕ ЕСТЬNULL(Файлы.ИндексКартинки, 2)
	|	КОНЕЦ КАК ИндексКартинки,
	|	Файлы.Наименование КАК Наименование,
	|	ВЫРАЗИТЬ(Файлы.Описание КАК СТРОКА(500)) КАК Описание,
	|	Файлы.Автор,
	|	Файлы.ДатаСоздания,
	|	Файлы.Изменил КАК Отредактировал,
	|	ДОБАВИТЬКДАТЕ(Файлы.ДатаМодификацииУниверсальная, СЕКУНДА, &СекундДоМестногоВремени) КАК ДатаИзменения,
	|	ВЫРАЗИТЬ(Файлы.Размер / 1024 КАК ЧИСЛО(10, 0)) КАК Размер,
	|	Файлы.ПодписанЭП,
	|	Файлы.Зашифрован,
	|	ВЫБОР
	|		КОГДА Файлы.ПодписанЭП И Файлы.Зашифрован
	|		ТОГДА 2
	|		КОГДА Файлы.Зашифрован
	|		ТОГДА 1
	|		КОГДА Файлы.ПодписанЭП
	|		ТОГДА 0
	|		ИНАЧЕ -1
	|	КОНЕЦ КАК НомерКартинкиПодписанЗашифрован,
	|	ВЫБОР
	|		КОГДА НЕ Файлы.Редактирует В (&ПустыеПользователи)
	|		ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ФайлРедактируется,
	|	ВЫБОР
	|		КОГДА Файлы.Редактирует = &ТекущийПользователь
	|		ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ФайлРедактируетТекущийПользователь,
	|	ВЫБОР
	|		КОГДА НЕ Файлы.Редактирует В (&ПустыеПользователи) И Файлы.Редактирует <> &ТекущийПользователь
	|		ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ФайлРедактируетДругойПользователь,
	|	Файлы.Расширение КАК Расширение,
	|	ВЫБОР
	|		КОГДА Статусы.УчетнаяЗапись <> НЕОПРЕДЕЛЕНО И Файлы.Редактирует = НЕОПРЕДЕЛЕНО
	|		ТОГДА Статусы.УчетнаяЗапись
	|		ИНАЧЕ Файлы.Редактирует
	|	КОНЕЦ КАК Редактирует,
	|	Файлы.Редактирует КАК РедактируетПользователь,
	|	ЛОЖЬ КАК ЭтоГруппа,
	|	&Служебный КАК Служебный,
	|	Файлы.ВладелецФайла КАК ВладелецФайла, 
	|	Файлы.ХранитьВерсии КАК ХранитьВерсии
	|ИЗ
	|	Справочник.смартГрузыПрисоединенныеФайлы КАК Файлы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыСинхронизацииФайловСОблачнымСервисом КАК Статусы
	|		ПО Файлы.Ссылка = Статусы.Файл
	|ГДЕ
	|	Файлы.ВладелецФайла = &ВладелецФайлов
	|	И НЕ Файлы.ПометкаУдаления";
	
    СвойстваСписка.ТекстЗапроса = ТекстЗапроса;
	СвойстваСписка.ДинамическоеСчитываниеДанных = Истина;
	СвойстваСписка.ОсновнаяТаблица  = "Справочник.смартГрузыПрисоединенныеФайлы";
	ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Элементы.Список, СвойстваСписка);
	
	ПустыеПользователи = Новый Массив;
	ПустыеПользователи.Добавить(Неопределено);
	ПустыеПользователи.Добавить(Справочники.Пользователи.ПустаяСсылка());
	ПустыеПользователи.Добавить(Справочники.ВнешниеПользователи.ПустаяСсылка());
	ПустыеПользователи.Добавить(Справочники.УчетныеЗаписиСинхронизацииФайлов.ПустаяСсылка());
	
	Список.Параметры.УстановитьЗначениеПараметра("ВладелецФайлов",      Объект.Ссылка);
	Список.Параметры.УстановитьЗначениеПараметра("ТекущийПользователь", Пользователи.АвторизованныйПользователь());
	Список.Параметры.УстановитьЗначениеПараметра("ПустыеПользователи",  ПустыеПользователи);
	
	ДатаУниверсальная = ТекущаяДатаСеанса();
	Список.Параметры.УстановитьЗначениеПараметра("СекундДоМестногоВремени",
	МестноеВремя(ДатаУниверсальная, ЧасовойПоясСеанса()) - ДатаУниверсальная);
	
КонецПроцедуры //-- #1621 смарт: Мосолов 05.02.2024

//++ #1621 смарт: Мосолов 05.02.2024 //Грузы. Доработать ПрисоединеныеФайлы 
&НаКлиенте
Процедура ДобавитьФайл(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	ГруппаФайлов = Неопределено;  
	
	Если ТекущиеДанные <> Неопределено И ТекущиеДанные.ЭтоГруппа И ТекущиеДанные.ВладелецФайла = Объект.Ссылка Тогда
		ГруппаФайлов = ТекущиеДанные.Ссылка;
	КонецЕсли; 
	
	РаботаСФайламиСлужебныйКлиент.ДобавитьФайлИзФайловойСистемы(Объект.Ссылка, ЭтотОбъект);
	
	Элементы.Список.Обновить();
	
КонецПроцедуры //-- #1621 смарт: Мосолов 05.02.2024

//++ #1621 смарт: Мосолов 05.02.2024 //Грузы. Доработать ПрисоединеныеФайлы 
&НаКлиенте
Процедура Редактировать(Команда)
	
	Если НЕ ФайловыеКомандыДоступны() Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если (ТекущиеДанные.ФайлРедактируется И НЕ ТекущиеДанные.ФайлРедактируетТекущийПользователь)
		ИЛИ ТекущиеДанные.Зашифрован
		ИЛИ ТекущиеДанные.ПодписанЭП Тогда 
		
		Возврат;
		
	КонецЕсли;
	
	РаботаСФайламиСлужебныйКлиент.РедактироватьСОповещением(Неопределено, ТекущиеДанные.Ссылка);
	
КонецПроцедуры //-- #1621 смарт: Мосолов 05.02.2024

//++ #1621 смарт: Мосолов 05.02.2024 //Грузы. Доработать ПрисоединеныеФайлы 
&НаКлиенте
Процедура ЗакончитьРедактирование(Команда)
	
	МассивФайлов = Новый Массив;    
	
	Для Каждого ЭлементСписка Из Элементы.Список.ВыделенныеСтроки Цикл
		
		ДанныеСтроки = ДанныеСтрокиСписка(ЭлементСписка);
		
		Если НЕ ДанныеСтроки.ФайлРедактируется
			Или НЕ ДанныеСтроки.ФайлРедактируетТекущийПользователь Тогда
			
			Продолжить;
		КонецЕсли;
		
		МассивФайлов.Добавить(ДанныеСтроки.Ссылка);
		
	КонецЦикла;
	
	Если МассивФайлов.Количество() > 1 Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("МассивФайлов",                     МассивФайлов);
		ПараметрыФормы.Вставить("ВозможностьСоздаватьВерсииФайлов", Истина);
		ПараметрыФормы.Вставить("Редактирует",                      ДанныеСтроки.РедактируетПользователь);
		
		ОткрытьФорму("Обработка.РаботаСФайлами.Форма.ФормаЗавершениеРедактирования", ПараметрыФормы, ЭтотОбъект); 
		
	ИначеЕсли МассивФайлов.Количество() = 1 Тогда  
		
		ПараметрыОбновленияФайла = РаботаСФайламиСлужебныйКлиент.ПараметрыОбновленияФайла(Неопределено, ДанныеСтроки.Ссылка, УникальныйИдентификатор);
		РаботаСФайламиСлужебныйКлиент.ЗакончитьРедактированиеСОповещением(ПараметрыОбновленияФайла); 
		
	КонецЕсли;
	
КонецПроцедуры //-- #1621 смарт: Мосолов 05.02.2024 

//++ #1621 смарт: Мосолов 05.02.2024 //Грузы. Доработать ПрисоединеныеФайлы 
&НаКлиенте
Процедура ОткрытьФайлДляПросмотра(Команда)
	
	Если НЕ ФайловыеКомандыДоступны() Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные.Зашифрован Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗапрещенныеРасширения.НайтиПоЗначению(ТекущиеДанные.Расширение) <> Неопределено Тогда
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ТекущиеДанные", ТекущиеДанные);  
		
		Оповещение = Новый ОписаниеОповещения("ОткрытьФайлПослеПодтверждения", ЭтотОбъект, ДополнительныеПараметры); 
		
		ПараметрыФормы = Новый Структура("Ключ", "ПередОткрытиемФайла");
		ПараметрыФормы.Вставить("ИмяФайла",
			ОбщегоНазначенияКлиентСервер.ПолучитьИмяСРасширением(ТекущиеДанные.Наименование, ТекущиеДанные.Расширение));  
			
		ОткрытьФорму("ОбщаяФорма.ПредупреждениеБезопасности", ПараметрыФормы, , , , , Оповещение);
		
		Возврат;  
		
	КонецЕсли;
	
	ФайлРедактируется = ТекущиеДанные.ФайлРедактируется И ТекущиеДанные.ФайлРедактируетТекущийПользователь;
	ДанныеФайла = РаботаСФайламиСлужебныйВызовСервера.ДанныеФайлаДляОткрытия(ТекущиеДанные.Ссылка, Неопределено, УникальныйИдентификатор);
	
	Если ДанныеФайла.Зашифрован Тогда  
		
		// Файл может быть изменен в другом сеансе.
		ОповеститьОбИзменении(ТекущиеДанные.Ссылка);
		Возврат; 
		
	КонецЕсли;
	
	РаботаСФайламиКлиент.ОткрытьФайл(ДанныеФайла, ФайлРедактируется);
	
КонецПроцедуры //-- #1621 смарт: Мосолов 05.02.2024   

//++ #1621 смарт: Мосолов 05.02.2024 //Грузы. Доработать ПрисоединеныеФайлы 
&НаКлиенте
Функция ФайловыеКомандыДоступны()
	
	Возврат РаботаСФайламиСлужебныйКлиент.ФайловыеКомандыДоступны(Элементы);
	
КонецФункции //-- #1621 смарт: Мосолов 05.02.2024

//++ #1621 смарт: Мосолов 05.02.2024 //Грузы. Доработать ПрисоединеныеФайлы 
&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьДоступныеКоманды(ТекущиеДанныеФайла, ВозможностьОсвободитьФайл, АвторизованныйПользователь)
	
	ИменаКоманд = ПолучитьИменаКомандФормы();
	
	ФайлРедактируетТекущийПользователь = ТекущиеДанныеФайла.ФайлРедактируетТекущийПользователь;
	АвторТекущийПользователь           = ТекущиеДанныеФайла.Автор = АвторизованныйПользователь;
	ФайлРедактируется                  = ТекущиеДанныеФайла.ФайлРедактируется;
	ФайлПодписан                       = ТекущиеДанныеФайла.ПодписанЭП;
	ФайлЗашифрован                     = ТекущиеДанныеФайла.Зашифрован;
	
	Если ФайлРедактируется Тогда
		
		Если НЕ ФайлРедактируетТекущийПользователь Тогда 
			
			УдалитьКомандуИзМассива(ИменаКоманд, "ЗакончитьРедактирование");
			УдалитьКомандуИзМассива(ИменаКоманд, "Редактировать"); 
			
		КонецЕсли;
		
	Иначе 
		
		УдалитьКомандуИзМассива(ИменаКоманд, "ЗакончитьРедактирование");  
		
	КонецЕсли;
	
	Если ФайлПодписан Тогда
		
		УдалитьКомандуИзМассива(ИменаКоманд, "ЗакончитьРедактирование");
		УдалитьКомандуИзМассива(ИменаКоманд, "Редактировать");
		
	КонецЕсли;
	
	Если ФайлЗашифрован Тогда  
		
		УдалитьКомандуИзМассива(ИменаКоманд, "ЗакончитьРедактирование");
		УдалитьКомандуИзМассива(ИменаКоманд, "Редактировать"); 
		
	КонецЕсли;
	
	Возврат ИменаКоманд;
	
КонецФункции //-- #1621 смарт: Мосолов 05.02.2024

//++ #1621 смарт: Мосолов 05.02.2024 //Грузы. Доработать ПрисоединеныеФайлы 
&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьИменаКомандФормы()
	
	ИменаКоманд = ПолучитьИменаКомандИзмененияОбъектов();
	
	Возврат ИменаКоманд;
	
КонецФункции //-- #1621 смарт: Мосолов 05.02.2024

//++ #1621 смарт: Мосолов 05.02.2024 //Грузы. Доработать ПрисоединеныеФайлы 
&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьИменаКомандИзмененияОбъектов()
	
	ИменаКоманд = Новый Массив;
	
	// Команды зависимые от состояния объектов.
	ИменаКоманд.Добавить("ЗакончитьРедактирование");
	ИменаКоманд.Добавить("Редактировать");
	
	// Команды независимые от состояния объектов.
	ИменаКоманд.Добавить("ДобавитьФайл");
	
	Возврат ИменаКоманд;
	
КонецФункции //-- #1621 смарт: Мосолов 05.02.2024

//++ #1621 смарт: Мосолов 05.02.2024 //Грузы. Доработать ПрисоединеныеФайлы 
&НаКлиентеНаСервереБезКонтекста
Процедура УдалитьКомандуИзМассива(Массив, ИмяКоманды)
	
	Позиция = Массив.Найти(ИмяКоманды);
	
	Если Позиция = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Массив.Удалить(Позиция);
	
КонецПроцедуры //-- #1621 смарт: Мосолов 05.02.2024


//++ #1621 смарт: Мосолов 05.02.2024 //Грузы. Доработать ПрисоединеныеФайлы 
&НаКлиенте
Функция ДанныеСтрокиСписка(ЭлементСписка)
	
	Возврат Элементы.Список.ДанныеСтроки(ЭлементСписка);
	
КонецФункции //-- #1621 смарт: Мосолов 05.02.2024

//++ #1621 смарт: Мосолов 05.02.2024 //Грузы. Доработать ПрисоединеныеФайлы 
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элементы.Список.РежимВыбора Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если Элементы.Список.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.ЭтоГруппа Тогда 
		
		ПоказатьЗначение(, ВыбраннаяСтрока);
		Возврат;   
		
	КонецЕсли;
	
	КакОткрывать = РаботаСФайламиСлужебныйКлиент.ПерсональныеНастройкиРаботыСФайлами().ДействиеПоДвойномуЩелчкуМыши;
	
	Если КакОткрывать = "ОткрыватьКарточку" Тогда
		
		ПоказатьЗначение(, ВыбраннаяСтрока);
		Возврат;  
		
	КонецЕсли;
	
	ДанныеФайла = РаботаСФайламиСлужебныйВызовСервера.ДанныеФайлаДляОткрытия(ВыбраннаяСтрока,
		Неопределено, УникальныйИдентификатор, Неопределено, ПредыдущийАдресФайла);
	
	ПараметрыОбработчика = Новый Структура;
	ПараметрыОбработчика.Вставить("ДанныеФайла", ДанныеФайла);
	Обработчик = Новый ОписаниеОповещения("СписокВыборПослеВыбораРежимаРедактирования", ЭтотОбъект, ПараметрыОбработчика);
	
	РаботаСФайламиСлужебныйКлиент.ВыбратьРежимИРедактироватьФайл(Обработчик, ДанныеФайла, Не ДанныеФайла.Служебный);
	
КонецПроцедуры //-- #1621 смарт: Мосолов 05.02.2024

//++ #1621 смарт: Мосолов 05.02.2024 //Грузы. Доработать ПрисоединеныеФайлы 
&НаКлиенте
Процедура ОткрытьСвойстваФайла(Команда) 
	
	ОткрытьКарточкуФайла();  
	
КонецПроцедуры //-- #1621 смарт: Мосолов 05.02.2024  

//++ #1621 смарт: Мосолов 05.02.2024 //Грузы. Доработать ПрисоединеныеФайлы 
&НаКлиенте
Процедура ОткрытьКарточкуФайла()
	
	Если НЕ ФайловыеКомандыДоступны() Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ",              ТекущиеДанные.Ссылка);
	ПараметрыФормы.Вставить("ТолькоПросмотр",    ТолькоПросмотр);
	ПараметрыФормы.Вставить("ПараметрыОтправки", ПолучитьПараметрыОтправки());
	
	Если ТекущиеДанные.ЭтоГруппа Тогда
		
		ОткрытьФорму("Обработка.РаботаСФайлами.Форма.ГруппаФайлов", ПараметрыФормы); 
		
	Иначе
		
		РаботаСФайламиКлиент.ОткрытьФормуФайла(ТекущиеДанные.Ссылка,, ПараметрыФормы);
		
	КонецЕсли;
	
КонецПроцедуры //-- #1621 смарт: Мосолов 05.02.2024

//++ #1621 смарт: Мосолов 05.02.2024 //Грузы. Доработать ПрисоединеныеФайлы 
&НаКлиенте
Процедура СписокВыборПослеВыбораРежимаРедактирования(Результат, ПараметрыВыполнения) Экспорт
	
	Если Результат = "Редактировать" Тогда
		
		Обработчик = Новый ОписаниеОповещения("СписокВыборПослеРедактированияФайла", ЭтотОбъект, ПараметрыВыполнения);
		РаботаСФайламиСлужебныйКлиент.РедактироватьФайл(Обработчик, ПараметрыВыполнения.ДанныеФайла);
		
	ИначеЕсли Результат = "Открыть" Тогда
		
		РаботаСФайламиКлиент.ОткрытьФайл(ПараметрыВыполнения.ДанныеФайла, Ложь); 
		
	КонецЕсли;
	
КонецПроцедуры //-- #1621 смарт: Мосолов 05.02.2024

//++ #1621 смарт: Мосолов 05.02.2024 //Грузы. Доработать ПрисоединеныеФайлы 
&НаКлиенте
Процедура СписокВыборПослеРедактированияФайла(Результат, ПараметрыВыполнения) Экспорт
	
	ОповеститьОбИзменении(ПараметрыВыполнения.ДанныеФайла.Ссылка);
	
КонецПроцедуры //-- #1621 смарт: Мосолов 05.02.2024

//++ #1621 смарт: Мосолов 05.02.2024 //Грузы. Доработать ПрисоединеныеФайлы 
&НаСервереБезКонтекста
Функция ПолучитьПараметрыОтправки()  
	
	Возврат РаботаСФайламиСлужебный.ПодготовитьСтруктуруПараметровОтправки();
	
КонецФункции //-- #1621 смарт: Мосолов 05.02.2024

//++ #1621 смарт: Мосолов 05.02.2024 //Грузы. Доработать ПрисоединеныеФайлы 
&НаКлиенте
Процедура УстановитьПометкуУдаления(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;  
	
	Если ТекущиеДанные <> Неопределено Тогда   
		
		ШаблонВопроса = ?(ТекущиеДанные.ПометкаУдаления,
			НСтр("ru = 'Снять с ""%1"" пометку на удаление?'"),
			НСтр("ru = 'Пометить ""%1"" на удаление?'"));     
			
		ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонВопроса, ТекущиеДанные.Наименование);
		ДополнительныеПараметры = Новый Структура("ФайлСсылка", ТекущиеДанные.Ссылка);
		Оповещение = Новый ОписаниеОповещения("ПослеВопросОПометкиНаУдаление", ЭтотОбъект, ДополнительныеПараметры);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);  
		
	КонецЕсли;   
	
КонецПроцедуры  //-- #1621 смарт: Мосолов 05.02.2024 

//++ #1621 смарт: Мосолов 05.02.2024 //Грузы. Доработать ПрисоединеныеФайлы 
&НаКлиенте
Процедура ПослеВопросОПометкиНаУдаление(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда 
		
		УстановитьСнятьПометкуУдаления(ДополнительныеПараметры.ФайлСсылка);  
		
		Элементы.Список.Обновить();
		
	КонецЕсли;
	
КонецПроцедуры //-- #1621 смарт: Мосолов 05.02.2024 

//++ #1621 смарт: Мосолов 05.02.2024 //Грузы. Доработать ПрисоединеныеФайлы 
&НаСервереБезКонтекста
Процедура УстановитьСнятьПометкуУдаления(ФайлСсылка)
	
	ФайлСсылка.ПолучитьОбъект().УстановитьПометкуУдаления(Не ФайлСсылка.ПометкаУдаления); 
	
КонецПроцедуры //-- #1621 смарт: Мосолов 05.02.2024

//++ #1621 смарт: Мосолов 05.02.2024 //Грузы. Доработать ПрисоединеныеФайлы 
&НаКлиенте
Процедура Удалить(Команда)
	
	Если Элементы.Список.ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РаботаСФайламиСлужебныйКлиент.УдалитьДанные(
		Новый ОписаниеОповещения("ПослеУдаленияДанных", ЭтотОбъект),
		Элементы.Список.ТекущиеДанные.Ссылка, УникальныйИдентификатор);
	
КонецПроцедуры //-- #1621 смарт: Мосолов 05.02.2024  
	
//++ #1621 смарт: Мосолов 05.02.2024 //Грузы. Доработать ПрисоединеныеФайлы 
&НаКлиенте
Процедура ПослеУдаленияДанных(Результат, ДополнительныеПараметры) Экспорт
	
	Элементы.Список.Обновить();
	
КонецПроцедуры //-- #1621 смарт: Мосолов 05.02.2024

//++ #1638 смарт: Ермаков 20.02.2024 / Грузы. Сделать связь объектов
// Выполняет поиск смежных грузов, в которых есть указанные в таблице контейнеры.
// Выводит дополнительных колонки в таблице СписокКонтейнеров, с гиперссылками на Грузы.
&НаСервере
Процедура СписокКонтейнеровОбновитьИнформациюОСмежныхГрузах()
	
	ТаблицаКонтейнеры = РеквизитФормыВЗначение("СписокКонтейнеров", Тип("ТаблицаЗначений"));
	
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("МассивКонтейнеров", ТаблицаКонтейнеры.ВыгрузитьКолонку("Контейнер"));
	Запрос.УстановитьПараметр("ТекущийГруз", Объект.Ссылка);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
	|	Контейнер, Груз
	|ИЗ 
	|	РегистрСведений.смартСобытияКонтейнеров
	|ГДЕ
	|	Контейнер В (&МассивКонтейнеров) 
	|	И НЕ Контейнер = ЗНАЧЕНИЕ(Справочник.смартКонтейнеры.ПустаяСсылка)
	|	И НЕ Груз = &ТекущийГруз
	|	И НЕ Груз = ЗНАЧЕНИЕ(Справочник.смартГрузы.ПустаяСсылка)
	|УПОРЯДОЧИТЬ ПО
	|	Контейнер ВОЗР, Груз.ДатаПоступления УБЫВ
	|ИТОГИ ПО Контейнер
	|";
	
	// Перебираем контейнеры
	ВыборкаКонтейнеров = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаКонтейнеров.Следующий() Цикл
		
		// Находим строку в таблице СписокКонтейнеров
		НайденнаяСтрокаТаблицыКонтейнеры = ТаблицаКонтейнеры.Найти(ВыборкаКонтейнеров.Контейнер, "Контейнер");
		
		Нумератор = 1;
		МассивДобавляемыхРеквизитовФормы = Новый Массив;
		
		// Перебираем грузы, в которые входит контейнер
		ВыборкаГрузов = ВыборкаКонтейнеров.Выбрать();
		Пока ВыборкаГрузов.Следующий() Цикл
			
			ИмяКолонки = "Груз" + Строка(Нумератор); // Груз1
			ЗаголовокКолонки = "Груз - " + Строка(Нумератор); // Груз - 1
			
			// Добавляем в таблицу колонку, если ее нет
			Если ТаблицаКонтейнеры.Колонки.Найти(ИмяКолонки) = Неопределено Тогда
				ТаблицаКонтейнеры.Колонки.Добавить(ИмяКолонки, Новый ОписаниеТипов("СправочникСсылка.смартГрузы"), ЗаголовокКолонки);	
			КонецЕсли;
			
			// Присваиваем значение выбранной строке таблицы
			НайденнаяСтрокаТаблицыКонтейнеры[ИмяКолонки] = ВыборкаГрузов.Груз; 
			
			// Формируем реквизиты для таблицы формы СписокКонтейнеров
			РеквизитНайден = Ложь;
			МассивРеквизитов = ЭтаФорма.ПолучитьРеквизиты("СписокКонтейнеров");
			
			Для Каждого РеквизитФормы Из МассивРеквизитов Цикл
				
				Если РеквизитФормы.Имя = ИмяКолонки Тогда
					РеквизитНайден = Истина;
				КонецЕсли;
				
			КонецЦикла;
			
			Если Не РеквизитНайден Тогда
				
				// Добавляем реквизит (колонку) таблицы
				МассивДобавляемыхРеквизитовФормы.Добавить(
					Новый РеквизитФормы(
							ИмяКолонки, 
							Новый ОписаниеТипов("СправочникСсылка.смартГрузы"), 
							"СписокКонтейнеров", 
							ЗаголовокКолонки)
				);
								
			КонецЕсли;
			
			Нумератор = Нумератор + 1;
			
		КонецЦикла;
		
		Если МассивДобавляемыхРеквизитовФормы.Количество() > 0 Тогда
			
			ЭтаФорма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитовФормы);
			
			// Добавляем на форму элементы согласно добавленным реквизитам
			Для Каждого РеквизитФормы Из МассивДобавляемыхРеквизитовФормы Цикл
				
				НовыйЭлементФормы = ЭтаФорма.Элементы.Добавить(РеквизитФормы.Имя, Тип("ПолеФормы"), ЭтаФорма.Элементы.СписокКонтейнеров);
				НовыйЭлементФормы.ПутьКДанным = "СписокКонтейнеров." + РеквизитФормы.Имя;
				НовыйЭлементФормы.Вид = ВидПоляФормы.ПолеНадписи;  
				НовыйЭлементФормы.ГиперссылкаЯчейки = Истина; 
				НовыйЭлементФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
				
			КонецЦикла;
			
		КонецЕсли;
				
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ТаблицаКонтейнеры, "СписокКонтейнеров");
	
КонецПроцедуры //-- #1638 смарт: Ермаков 20.02.2024 

//++ #1638 смарт: Ермаков 20.02.2024 / Грузы. Сделать связь объектов. 
&НаКлиенте
Процедура СписокКонтейнеровВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если СтрНайти(Поле.Имя, "Груз") Тогда
		
		СтандартнаяОбработка = Ложь;
		ПоказатьЗначение(, Элемент.ТекущиеДанные[Поле.Имя]);
		
	КонецЕсли;
	
КонецПроцедуры //-- #1638 смарт: Ермаков 20.02.2024

#КонецОбласти
